Revit 2026 API

# BuiltInFailuresBeamSystemFailures Class

---

Failures about BeamSystem.

SystemObject Autodesk.Revit.DBBuiltInFailuresBeamSystemFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class BeamSystemFailures
```
```vb
Public NotInheritable Class BeamSystemFailures
```
```cpp
public ref class BeamSystemFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BeamSystemFailures = class end
```

The BuiltInFailuresBeamSystemFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BeamSystemEdgeBeamTooWide | Beam of user-defined type does not fit into beam system with clear spacing layout rule. Beam type is reset to default. |
|  | BeamSystemHasTooManyBeams | A beam system is trying to create more than 500 beams. Please use multiple beam systems if more than 500 beams are desired. |
|  | BeamSystemTagBadView | Beam System Tags can only be placed in plan , elevation and 3D views. |

#### Reference

Autodesk.Revit.DB Namespace